console.log('132'+ 23); // стає все рядком
console.log(0 + '213'); // стає все рядком
console.log((24 + 24 + 'px')); // між собою числа додаються, а потім після додавання іде рядок із словом він плючується 
console.log(typeof(''+ 234));
console.log('343' - 43);
console.log('24px' - 2);
console.log('aa ' -10+3);
console.log('23' / '32'); // якщо ми використовуємо множення ділення віднімання між рядком відбувається розрахунок
console.log(23 * 23); // між числами множиться 
console.log('24px'+ 5+3);
console.log('24' -24); //стає цифрою намагається розрахувати